# Manipulando Tablas II


Métodos y funciones usadas:

```python
.concat()
.merge()

```

Vamos a practicar con funciones de *Pandas* que se utilizan para combinar o unir DataFrames, pero se utilizan en diferentes contextos y tienen diferentes funcionalidades.
* La función *concat* se utiliza para concatenar o apilar *DataFrames* a lo largo de un eje, ya sea filas (axis=0) o columnas (axis=1). 
* La función *merge* se utiliza para combinar dos *DataFrames* basándose en una o más columnas comunes.

## La función *concat*.

### Paso 1. 
Importa las librerías necesarias.

In [1]:
import pandas as pd

### Paso 2. 
Carga los datos de los dos ficheros de datos sobre coches. Usa el método:

``` python
.read_csv()
```

In [2]:
coches_1 = pd.read_csv('../Archivos/cars1.csv')
coches_2 = pd.read_csv('../Archivos/cars2.csv')

Imprime las cabeceras de ambos datasets.
Verás que el primer dataframe tiene columnas sin datos. Elimínalas 
Puedes hacerlo de varias maneras:
``` python
cars1 = cars1.drop(["Unnamed: 9","Unnamed: 10","Unnamed: 11","Unnamed: 12","Unnamed: 13"], axis= 1)
```
o
``` python
cars1 = cars1.loc[:, "mpg":"car"]
```
Esta última solo guarda en *cars1* todas las filas y las columnas entre *"mpg"* y *"car"*

In [5]:
coches_1.head(10)
#coches_2.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,NaN,NaN,NaN,NaN,NaN
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,NaN,NaN,NaN,NaN,NaN
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,NaN,NaN,NaN,NaN,NaN
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,NaN,NaN,NaN,NaN,NaN
4,17.0,8,302,140,3449,10.5,70,1,ford torino,NaN,NaN,NaN,NaN,NaN
5,15.0,8,429,198,4341,10.0,70,1,ford galaxie 500,NaN,NaN,NaN,NaN,NaN
6,14.0,8,454,220,4354,9.0,70,1,chevrolet impala,NaN,NaN,NaN,NaN,NaN
7,14.0,8,440,215,4312,8.5,70,1,plymouth fury iii,NaN,NaN,NaN,NaN,NaN
8,14.0,8,455,225,4425,10.0,70,1,pontiac catalina,NaN,NaN,NaN,NaN,NaN
9,15.0,8,390,190,3850,8.5,70,1,amc ambassador dpl,NaN,NaN,NaN,NaN,NaN

In [7]:
coches_1 = coches_1.loc[:, 'mpg':'car']

SyntaxError: invalid syntax (2466208950.py, line 1)

### Paso 3.

Imprime el número de registros y columnas en cada dataset

### Paso 4.
Ahora que has comprobado que los dos *DataFrames* tienen el mismo número de columnas vamos a comprobar que las columnas tienen los mismos nombres (no hace falta que el orden coincida).

### Paso 5.
Junta los dos *DataFrames* en uno solo de nombre *cars_total*. Usa la función de *Pandas* 
``` python
pd.concat(, axis = 0)
```
Emplea *axis=0* para combinarlos verticalmente, uno debajo del otro.

Fijate que en principio hay 409 filas pero el último registro tiene índice 210. Los índices no se han actualizado. 
Repite la sentencia anterior añadiendo *ignore_index=True* despues de *axis= 0*

### Paso 6.

Usa el método 
``` python
.duplicated()
```
para comprobar si hay filas duplicadas en el DataFrame concatenado.
Este método devuelve una *Serie* de True o False según si la fila está duplicada de una anterior.

### Paso 7.

Usando el método 
``` python
.drop_duplicates()
```
elimina las filas duplicadas en el *DataFrame* *cars_total*.

## La función *merge*

### Paso 8.

Crea dos nuevos *DataFrames* partiendo de *cars2*.
*  En *cars3* copia las columnas: 'mpg','cylinders','horsepower' y 'car' de los registros del 20 al 40 de *cars2* 
*  En *cars4* copia las columnas: 'weight' y 'car' de los registros del 25 al 45 de *cars2*

### Paso 9.

Añade una columna a *cars4* de nombre 'mileage' donde almacenarás para cada registro un numero entero aleatorio de valor entre 10.000 y 30.000 ambos incluidos.

### Paso 10.

Combinar los dos *DataFrames*: *cars3* y *cars4* basándose en la columna común 'car'.
Usa:
```python
merge(df1, df2, on='car', how='outer')
```
para devolver un *DataFrame* *total_cars_2* con todas las filas de ambos *DataFrames*, rellenando con *NaN* cuando no haya correspondencia (unión).

### Paso 11.

* Cuenta el número total de valores nulos que hay en cada columna.
* Cuenta el número total de valores **no** nulos que hay en cada columna.
* Cuenta el número total de registros(filas) que tienen al menos un valor *NaN* en el *DataFrame* 
* Cuenta el número total de columnas que tienen al menos un valor *NaN* en el *DataFrame*

### Paso 12.

Combinar los dos *DataFrames*: *cars3* y *cars4* basándose en la columna común 'car'.
Usa:
```python
merge(df1, df2, on='car', how='inner')
```
para devolver un *DataFrame* *total_cars_3* que contenga solo las filas que tienen correspondencia en ambos DataFrames (intersección).

### Paso 13.

Reorganiza el *DataFrame* para que use como indice de cada registro la columna 'car'.